app/Controllers/Coches.php

SELECT *
FROM `marcas`
---
    public function nuevo() {

        helper('form'); // Asistente para funciones de formulario

        $model = model(MarcasModel::class);

        $data['marca'] = $model->findAll();

INSERT INTO `coches` (`modelo`, `precio`, `id_marca`) VALUES ('GT', '44000', '3')
---
    public function crear() {

       helper('form');

       // Validar los datos introducidos

       if (! $this->validate([
        'modelo' => 'required',
        'precio' => 'required|max_length[6]',
        'id_marca' => 'required',
       ])) {

            // Si la validación falla, se devuelve el formulario
            return $this->nuevo();

       } else {

            // Guardar los datos validados
            $post = $this->validator->getValidated();

            $model = model(CochesModel::class);

            $model->save([
                'modelo' => $post['modelo'],
                'precio' => $post['precio'],
                'id_marca' => $post['id_marca']
            ]);

SELECT *
FROM `coches`
WHERE `id` = '1'
SELECT *
FROM `marcas`
SELECT *
FROM `coches`
WHERE `id` = '14'
---
    public function modificar($id) {

        helper('form');

        if ($id == null) {

            throw new PageNotFoundException('No se puede actualizar el coche');

        }

        $model = model(CochesModel::class);

        $modelMarca = model(MarcasModel::class);

        if ($model->where('id', $id)->find()) {

            $data = [
                'title' => 'Modificar Coche',
                'coches' => $model->getCoches($id),
                'marca' => $modelMarca->findAll(),
            ];

UPDATE `coches` SET `modelo` = 'DB11', `precio` = '67000', `id_marca` = '4'
WHERE `coches`.`id` IN ('15')
INSERT INTO `coches` (`modelo`, `precio`, `id_marca`) VALUES ('M4 GTS', '28000', '1')
---
    public function modificado($id) {

        helper('form');

        // Validar los datos introducidos

        if (! $this->validate([
         'modelo' => 'required',
         'precio' => 'required|max_length[6]',
         'id_marca' => 'required',
        ])) {

             // Si la validación falla, se devuelve el formulario
             return $this->modificar($id);

        } else {

             // Guardar los datos validados
             $post = $this->validator->getValidated();

             $model = model(CochesModel::class);

             $model->save([
                 'id' => $id,
                 'modelo' => $post['modelo'],
                 'precio' => $post['precio'],
                 'id_marca' => $post['id_marca']
             ]);