app/Models/CochesModel.php

SELECT `coches`.*, `marcas`.`marca`
FROM `coches`
JOIN `marcas` ON `coches`.`id_marca`=`marcas`.`id`
ORDER BY `coches`.`id`
SELECT `coches`.*, `marcas`.`marca`
FROM `coches`
JOIN `marcas` ON `coches`.`id_marca`=`marcas`.`id`
WHERE `coches`.`id` = '2'
 LIMIT 1
---
    public function getCoches($id = false)
    {  // Por defeto el slug es false

        if ($id === false) {  // Si se llama a getCoches sin slug, se obtendrán todos los coches ya que el slug por defecto es false

            $sql = $this->select('coches.*, marcas.marca'); // No hacer marcas.* (al llamar a index.php después de pasar por el controlador Coches.php utiliza la última id (la de marcas))
            $sql = $this->join('marcas', 'coches.id_marca=marcas.id');
            $sql = $this->orderBy('coches.id');
            $sql = $this->findAll();
            return $sql;

        } else {    // Si no se obtendrá el coche por su slug

            $sql = $this->select('coches.*, marcas.marca');
            $sql = $this->join('marcas', 'coches.id_marca=marcas.id');
            $sql = $this->where(['coches.id' => $id]);
            $sql = $this->first();